<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<h2>歡迎來到 Mtyjl 的學習筆記!!</h2>
<p>
	2011 年 6 月網頁設計期末專案: <br /> 在html蓬勃發展的今日, 即使有無數的好站可以學習入門進本功,
	但想要輕鬆愉快無痛入門網頁設計一樣不是簡單的事, 教學網站上總是 有許多東西是大家看了範例還是很難體會的<br /> 過去的網頁開發者,
	又設計出許多令人驚嘆的作品, 動輒上百行的串接樣式和各種 javascript 函式庫,
	更是令我們這些網頁設計的入門者總覺得跟前人的距離是那麼遙遠, 不知要怎樣才能看見高手的車尾燈
</p>
<p>因此想籍網頁設計課程的期末專案, 完成一個網頁設計教學網站 ,整理過去學習過程中各式各樣的學記筆記,
	希望能提供各種的範例盡量讓大家無痛上手</p>
<p></p>
<p>
	2013 年 9 月:<br /> 退伍後在本站重新整理大學四年寫的各種玩具與心得
</p>