<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<h2>Web 期末網站設計報告書</h2>
<h3>網站名稱:</h3>
<p>Mtyjl 的網頁網頁設計學習筆記</p>
<h3>網站目標與目的:</h3>
<p>現在學網頁設計, 有太多東西要讀, 對一個html只有基本認識的 我們來說, 可能會需要學html, CSS, 要是想玩一些花樣,
	就還要再學 javascript 操作瀏覽器</p>
<p>
	但是即使在 html 蓬勃發展的今日, 有無數的好站可以學習入門進本功, 想要輕鬆愉快無痛地入門網頁設計一樣不是簡單的事, 教學網站上總是
	有許多東西是大家看完說明還是很難體會的東西<br /> 而且過去的網頁開發者, 又設計出許多令人驚嘆的作品, 動輒上百行的串接樣式和
	javascript 腳本, 更是令我們這些網頁設計的入門者總覺得跟前人的距離是那麼遙遠, 不知要怎樣才能踏入高手的領域
</p>
<p>
	因此我想籍這次網頁設計課的期末專案, 練習開發一個網頁設計教學網站<br /> 這裡整理過去數個月學習過程中的心得筆記,
	還有各種不錯的範例例, 有些教學功能則是源自其他網站的設計概念
</p>
<h3>網站內容結構:</h3>
<p>
	目前主要規劃有三個區域, 顯示在報告書上方的選單列中: html 標籤介紹與範例, css介紹, 範例,技巧, javascript
	教學與範例<br />
<h3>內容項目說明:</h3>
<p>
	html 除了教學文站, 之後會漸漸補上範例與網頁元件實作教學<br /> css 一樣除了教學, 還有一些簡單的設計技巧和做中學的範例<br />
	javascript 會有些常見的範例, 例如網頁內容增修, ajax 等等....
</p>
<h3>時辰進度表:</h3>
<p>期末趁考試中間的休息空檔, 一有空做一點做一點....<br />
學期結束後再補上更多功能和內容, 預計七月前會有基本內容<br />
之後會試著寫出更多功能, 期望透過這個站展示個人的網站架設能力</p>
<h3>工具軟體:</h3>
<p>eclipse J2EE 版本<br />
網站架在 Google app engine 上</p>
<h3>預期成效與結果:</h3>
<p>就是完全填滿的內容與類似  W3 school 的現學現賣操作範例的練習功能</p>